////===========================================
////
//// エディットのメイン処理[edit.cpp]
//// Author 小原立暉
////
////===========================================
////*******************************************
//// インクルードファイル
////*******************************************
//#include "main.h"
//#include "manager.h"
//#include "renderer.h"
//#include "edit.h"
//#include "useful.h"
//
////==============================
//// コンストラクタ
////==============================
//CEdit::CEdit() : CModel(CObject::TYPE_SCREW, CObject::PRIORITY_ENTITY)
//{
//
//}
//
////==============================
//// デストラクタ
////==============================
//CEdit::~CEdit()
//{
//
//}
//
////==============================
////ブロックの初期化処理
////==============================
//HRESULT CEdit::Init(void)
//{
//	if (FAILED(CModel::Init()))
//	{ // 初期化処理に失敗した場合
//
//		// 失敗を返す
//		return E_FAIL;
//	}
//
//	// 値を返す
//	return S_OK;
//}
//
////========================================
////ブロックの終了処理
////========================================
//void CEdit::Uninit(void)
//{
//	// 終了処理
//	CModel::Uninit();
//}
//
////========================================
////ブロックの更新処理
////========================================
//void CEdit::Update(void)
//{
//
//}
//
////=====================================
////ブロックの描画処理
////=====================================
//void CEdit::Draw(void)
//{
//	// 描画処理
//	CModel::Draw();
//}
//
////=====================================
//// 情報の設定処理
////=====================================
//void CEdit::SetData(const D3DXVECTOR3& pos)
//{
//	// 情報の設定処理
//	SetPos(pos);								// 位置
//	SetPosOld(pos);								// 前回の位置
//	SetRot(NONE_D3DXVECTOR3);					// 向き
//	SetScale(D3DXVECTOR3(1.0f, 1.0f, 1.0f));	// 拡大率
//	SetFileData(CXFile::TYPE_SCREW);			// モデルの情報
//}
//
////=======================================
//// 生成処理
////=======================================
//CEdit* CEdit::Create(const D3DXVECTOR3& pos)
//{
//	// ローカルオブジェクトを生成
//	CEdit* pScrew = nullptr;	// インスタンスを生成
//
//	if (pScrew == nullptr)
//	{ // オブジェクトが NULL の場合
//
//		// インスタンスを生成
//		pScrew = new CEdit;
//	}
//	else
//	{ // オブジェクトが NULL じゃない場合
//
//		// NULL を返す
//		return nullptr;
//	}
//
//	if (pScrew != nullptr)
//	{ // オブジェクトが NULL じゃない場合
//
//		// 初期化処理
//		if (FAILED(pScrew->Init()))
//		{ // 初期化に失敗した場合
//
//			// 停止
//			assert(false);
//
//			// NULL を返す
//			return nullptr;
//		}
//
//		// 情報の設定処理
//		pScrew->SetData(pos);
//	}
//	else
//	{ // オブジェクトが NULL の場合
//
//		// NULL を返す
//		return nullptr;
//	}
//
//	// ネジのポインタを返す
//	return pScrew;
//}